# ShowMultipleRowsForMultiphaseCircuits Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..ShowMultipleRowsForMultiphaseCircuits Property
PanelScheduleData Class See Also
---
shows extra rows below multiphase circuits to indicate how many slots they take up if true, all on a single row otherwise
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool ShowMultipleRowsForMultiphaseCircuits { get; set; }
```

Visual Basic
---
```text
Public Property ShowMultipleRowsForMultiphaseCircuits As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowMultipleRowsForMultiphaseCircuits {
	bool get ();
	void set (bool value);
}
```

# Remarks
only applicable to one column formats
# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace